Revit 2027 API
EnergyAnalysisOpening.GetWindowType Method
 Gets the analytic window type this opening is associated with. Null when this opening is not a window.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisWindowType GetWindowType()
Public Function GetWindowType As EnergyAnalysisWindowType
public:
EnergyAnalysisWindowType^ GetWindowType()
member GetWindowType : unit -> EnergyAnalysisWindowType
Return Value
EnergyAnalysisWindowType
 The analytic window type.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace